HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxCbs_bf.h
/** \\brief  Offset for Ifx_CBS_TRIGC_Bits.TRGx_12 */
#define IFX_CBS_TRIGC_TRGX_12_OFF (12)

/** \\brief  Length for Ifx_CBS_TRIGC_Bits.TRGx_13 */
#define IFX_CBS_TRIGC_TRGX_13_LEN (1)

/** \\brief  Mask for Ifx_CBS_TRIGC_Bits.TRGx_13 */
#define IFX_CBS_TRIGC_TRGX_13_MSK (0x1)

/** \\brief  Offset for Ifx_CBS_TRIGC_Bits.TRGx_13 */
#define IFX_CBS_TRIGC_TRGX_13_OFF (13)

/** \\brief  Length for Ifx_CBS_TRIGC_Bits.TRGx_14 */
#define IFX_CBS_TRIGC_TRGX_14_LEN (1)

/** \\brief  Mask for Ifx_CBS_TRIGC_Bits.TRGx_14 */
#define IFX_CBS_TRIGC_TRGX_14_MSK (0x1)

/** \\brief  Offset for Ifx_CBS_TRIGC_Bits.TRGx_14 */
#define IFX_CBS_TRIGC_TRGX_14_OFF (14)

/** \\brief  Length for Ifx_CBS_TRIGC_Bits.TRGx_15 */
#define IFX_CBS_TRIGC_TRGX_15_LEN (1)

/** \\brief  Mask for Ifx_CBS_TRIGC_Bits.TRGx_15 */
#define IFX_CBS_TRIGC_TRGX_15_MSK (0x1)

/** \\brief  Offset for Ifx_CBS_TRIGC_Bits.TRGx_15 */
#define IFX_CBS_TRIGC_TRGX_15_OFF (15)

/** \\brief  Length for Ifx_CBS_TRIGC_Bits.TRGx_16 */
#define IFX_CBS_TRIGC_TRGX_16_LEN (1)

/** \\brief  Mask for Ifx_CBS_TRIGC_Bits.TRGx_16 */
#define IFX_CBS_TRIGC_TRGX_16_MSK (0x1)

/** \\brief  Offset for Ifx_CBS_TRIGC_Bits.TRGx_16 */
#define IFX_CBS_TRIGC_TRGX_16_OFF (16)

/** \\brief  Length for Ifx_CBS_TRIGC_Bits.TRGx_17 */
#define IFX_CBS_TRIGC_TRGX_17_LEN (1)

/** \\brief  Mask for Ifx_CBS_TRIGC_Bits.TRGx_17 */
#define IFX_CBS_TRIGC_TRGX_17_MSK (0x1)

/** \\brief  Offset for Ifx_CBS_TRIGC_Bits.TRGx_17 */
#define IFX_CBS_TRIGC_TRGX_17_OFF (17)

/** \\brief  Length for Ifx_CBS_TRIGC_Bits.TRGx_18 */
#define IFX_CBS_TRIGC_TRGX_18_LEN (1)

/** \\brief  Mask for Ifx_CBS_TRIGC_Bits.TRGx_18 */
#define IFX_CBS_TRIGC_TRGX_18_MSK (0x1)

/** \\brief  Offset for Ifx_CBS_TRIGC_Bits.TRGx_18 */
#define IFX_CBS_TRIGC_TRGX_18_OFF (18)

/** \\brief  Length for Ifx_CBS_TRIGC_Bits.TRGx_19 */
#define IFX_CBS_TRIGC_TRGX_19_LEN (1)

/** \\brief  Mask for Ifx_CBS_TRIGC_Bits.TRGx_19 */
#define IFX_CBS_TRIGC_TRGX_19_MSK (0x1)

/** \\brief  Offset for Ifx_CBS_TRIGC_Bits.TRGx_19 */
#define IFX_CBS_TRIGC_TRGX_19_OFF (19)

/** \\brief  Length for Ifx_CBS_TRIGC_Bits.TRGx_1 */
#define IFX_CBS_TRIGC_TRGX_1_LEN (1)

/** \\brief  Mask for Ifx_CBS_TRIGC_Bits.TRGx_1 */
#define IFX_CBS_TRIGC_TRGX_1_MSK (0x1)

/** \\brief  Offset for Ifx_CBS_TRIGC_Bits.TRGx_1 */
#define IFX_CBS_TRIGC_TRGX_1_OFF (1)

/** \\brief  Length for Ifx_CBS_TRIGC_Bits.TRGx_20 */
#define IFX_CBS_TRIGC_TRGX_20_LEN (1)

/** \\brief  Mask for Ifx_CBS_TRIGC_Bits.TRGx_20 */
#define IFX_CBS_TRIGC_TRGX_20_MSK (0x1)

/** \\brief  Offset for Ifx_CBS_TRIGC_Bits.TRGx_20 */
#define IFX_CBS_TRIGC_TRGX_20_OFF (20)

/** \\brief  Length for Ifx_CBS_TRIGC_Bits.TRGx_21 */
#define IFX_CBS_TRIGC_TRGX_21_LEN (1)

/** \\brief  Mask for Ifx_CBS_TRIGC_Bits.TRGx_21 */
#define IFX_CBS_TRIGC_TRGX_21_MSK (0x1)

/** \\brief  Offset for Ifx_CBS_TRIGC_Bits.TRGx_21 */
#define IFX_CBS_TRIGC_TRGX_21_OFF (21)

/** \\brief  Length for Ifx_CBS_TRIGC_Bits.TRGx_22 */
#define IFX_CBS_TRIGC_TRGX_22_LEN (1)

/** \\brief  Mask for Ifx_CBS_TRIGC_Bits.TRGx_22 */
#define IFX_CBS_TRIGC_TRGX_22_MSK (0x1)

/** \\brief  Offset for Ifx_CBS_TRIGC_Bits.TRGx_22 */
#define IFX_CBS_TRIGC_TRGX_22_OFF (22)

/** \\brief  Length for Ifx_CBS_TRIGC_Bits.TRGx_23 */
#define IFX_CBS_TRIGC_TRGX_23_LEN (1)

/** \\brief  Mask for Ifx_CBS_TRIGC_Bits.TRGx_23 */
#define IFX_CBS_TRIGC_TRGX_23_MSK (0x1)

/** \\brief  Offset for Ifx_CBS_TRIGC_Bits.TRGx_23 */
#define IFX_CBS_TRIGC_TRGX_23_OFF (23)

/** \\brief  Length for Ifx_CBS_TRIGC_Bits.TRGx_2 */
#define IFX_CBS_TRIGC_TRGX_2_LEN (1)

/** \\brief  Mask for Ifx_CBS_TRIGC_Bits.TRGx_2 */
#define IFX_CBS_TRIGC_TRGX_2_MSK (0x1)

/** \\brief  Offset for Ifx_CBS_TRIGC_Bits.TRGx_2 */
#define IFX_CBS_TRIGC_TRGX_2_OFF (2)

/** \\brief  Length for Ifx_CBS_TRIGC_Bits.TRGx_3 */
#define IFX_CBS_TRIGC_TRGX_3_LEN (1)

/** \\brief  Mask for Ifx_CBS_TRIGC_Bits.TRGx_3 */
#define IFX_CBS_TRIGC_TRGX_3_MSK (0x1)

/** \\brief  Offset for Ifx_CBS_TRIGC_Bits.TRGx_3 */
#define IFX_CBS_TRIGC_TRGX_3_OFF (3)

/** \\brief  Length for Ifx_CBS_TRIGC_Bits.TRGx_4 */
#define IFX_CBS_TRIGC_TRGX_4_LEN (1)

/** \\brief  Mask for Ifx_CBS_TRIGC_Bits.TRGx_4 */
#define IFX_CBS_TRIGC_TRGX_4_MSK (0x1)

/** \\brief  Offset for Ifx_CBS_TRIGC_Bits.TRGx_4 */
#define IFX_CBS_TRIGC_TRGX_4_OFF (4)

/** \\brief  Length for Ifx_CBS_TRIGC_Bits.TRGx_5 */
#define IFX_CBS_TRIGC_TRGX_5_LEN (1)

/** \\brief  Mask for Ifx_CBS_TRIGC_Bits.TRGx_5 */
#define IFX_CBS_TRIGC_TRGX_5_MSK (0x1)

/** \\brief  Offset for Ifx_CBS_TRIGC_Bits.TRGx_5 */
#define IFX_CBS_TRIGC_TRGX_5_OFF (5)

/** \\brief  Length for Ifx_CBS_TRIGC_Bits.TRGx_6 */
#define IFX_CBS_TRIGC_TRGX_6_LEN (1)

/** \\brief  Mask for Ifx_CBS_TRIGC_Bits.TRGx_6 */
#define IFX_CBS_TRIGC_TRGX_6_MSK (0x1)

/** \\brief  Offset for Ifx_CBS_TRIGC_Bits.TRGx_6 */
#define IFX_CBS_TRIGC_TRGX_6_OFF (6)

/** \\brief  Length for Ifx_CBS_TRIGC_Bits.TRGx_7 */
#define IFX_CBS_TRIGC_TRGX_7_LEN (1)

/** \\brief  Mask for Ifx_CBS_TRIGC_Bits.TRGx_7 */
#define IFX_CBS_TRIGC_TRGX_7_MSK (0x1)

/** \\brief  Offset for Ifx_CBS_TRIGC_Bits.TRGx_7 */
#define IFX_CBS_TRIGC_TRGX_7_OFF (7)

/** \\brief  Length for Ifx_CBS_TRIGC_Bits.TRGx_8 */
#define IFX_CBS_TRIGC_TRGX_8_LEN (1)

/** \\brief  Mask for Ifx_CBS_TRIGC_Bits.TRGx_8 */
#define IFX_CBS_TRIGC_TRGX_8_MSK (0x1)

/** \\brief  Offset for Ifx_CBS_TRIGC_Bits.TRGx_8 */
#define IFX_CBS_TRIGC_TRGX_8_OFF (8)

/** \\brief  Length for Ifx_CBS_TRIGC_Bits.TRGx_9 */
#define IFX_CBS_TRIGC_TRGX_9_LEN (1)

/** \\brief  Mask for Ifx_CBS_TRIGC_Bits.TRGx_9 */
#define IFX_CBS_TRIGC_TRGX_9_MSK (0x1)

/** \\brief  Offset for Ifx_CBS_TRIGC_Bits.TRGx_9 */
#define IFX_CBS_TRIGC_TRGX_9_OFF (9)

/** \\brief  Length for Ifx_CBS_TRIGC_Bits.x */
#define IFX_CBS_TRIGC_X_LEN (8)

/** \\brief  Mask for Ifx_CBS_TRIGC_Bits.x */
#define IFX_CBS_TRIGC_X_MSK (0xff)

/** \\brief  Offset for Ifx_CBS_TRIGC_Bits.x */
#define IFX_CBS_TRIGC_X_OFF (24)

/** \\brief  Length for Ifx_CBS_TRIGS_Bits.BITNUM */
#define IFX_CBS_TRIGS_BITNUM_LEN (13)

/** \\brief  Mask for Ifx_CBS_TRIGS_Bits.BITNUM */
#define IFX_CBS_TRIGS_BITNUM_MSK (0x1fff)

